Revit 2026 API

# Definition Methods

---

The Definition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDataType | Gets a ForgeTypeId identifying the data type describing values of the parameter. |
|  | GetGroupTypeId | Returns the identifier of the parameter definition's parameter group. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Definition Class

Autodesk.Revit.DB Namespace